import os

given_objects = [
    "갑티슈", "건전지", "고데기", "기저귀", "눈썹칼", "단추형전지", "달력", "도끼빗", "독서대", "돋보기", 
    "두루마리 휴지", "드라이어", "딱풀", "램프", "로션", "롤빗", "마우스", "머리띠", "머리핀", "메이크업 브러쉬", 
    "면도기", "면봉", "모기향", "모니터", "물감", "물티슈", "바가지", "바구니", "바리깡(헤어컷터)", "반창고", 
    "베개", "보조배터리", "본드", "분무기", "브러쉬빗", "블루투스 이어폰", "빗자루", "빨래집게", "색연필", "샤프", 
    "스마트폰", "스케치북", "스프레이 살충제", "스피커", "슬리퍼", "습기제거제", "시계", "쓰레받기", "아령", 
    "안경", "연필깎이", "열쇠", "염색빗", "옷걸이", "우산", "유리 세정제", "인형", "입욕제", "노트북", "전화기", 
    "주판기", "책", "청소솔", "카메라", "카메라렌즈", "컴퍼스", "컵", "크레파스", "키보드", "태블릿PC", "테이프클리너", 
    "토스터", "커피포트", "헤드폰", "형광펜", "화분", "USB", "커피포트", "계란", "고구마", "고추", "당근", "도넛", 
    "딸기", "레몬", "멜론", "바나나", "박스과자", "버섯", "버터", "복숭아", "봉지과자", "브로콜리", "사과", "샌드위치", 
    "소시지", "수박", "스팸", "양파", "오랜지", "요거트", "우유", "음료캔", "참치캔", "컵라면", "케쳡", "쿠키", "크래커", 
    "크림치즈", "파", "팩주스", "포도", "햄버거", "호박", "뚜러뻥", "비누", "비누받침", "샤워타월", "샴푸", "스퀴지", 
    "치간칫솔", "치실", "치약", "칫솔", "구두약", "글러브", "남성 구두", "넥타이", "다트", "단화", "레고", "루빅 큐브", 
    "모자", "반지", "백팩", "볼링핀", "붕대", "손전등", "신발주걱", "아동용 신발", "야구헬멧", "여권", "여성 구두", 
    "온도계", "운동화", "액자", "자석", "장화", "재떨이", "리모컨", "주사위", "지갑", "체스판", "체온계", "축구화", 
    "크록스", "키링", "타이머", "탬버린", "파스", "피규어", "필름", "필통", "하이힐", "항아리", "핸드백", "감자칼", 
    "거품기", "국자", "나이프", "냄비", "대접", "도마", "뒤집개", "뚝배기", "물통", "병솔", "수세미", "숟가락", 
    "스테인레스볼", "식칼", "알루미늄 호일", "어린이용 젓가락", "얼음 트레이", "와플기", "쟁반", "접시", "젓가락", 
    "주걱", "주발", "주방세제", "주방장갑", "주전자", "집게", "채칼", "청소기", "키친타월", "텀블러", "포크", 
    "포크 스푼", "후라이팬"
]

used_objects = [
    "달력", "독서대", "램프", "마우스", "모니터", "블루투스 이어폰", "스피커", "시계", "안경", 
    "인형", "전화기", "책", "카메라", "카메라렌즈", "키보드", "태블릿PC", "헤드폰", "노트북", 
    "리모컨", "체스판", "다트", "탬버린", "필름", "액자", "자석", "스마트폰", "바가지", "바구니", 
    "분무기", "컵", "토스터", "커피포트", "계란", "고구마", "고추", "당근", "도넛", "딸기", 
    "레몬", "멜론", "바나나", "박스과자", "버섯", "버터", "복숭아", "봉지과자", "브로콜리", "사과", 
    "샌드위치", "소시지", "수박", "스팸", "양파", "오랜지", "요거트", "우유", "음료캔", "참치캔", 
    "컵라면", "케쳡", "쿠키", "크래커", "크림치즈", "파", "팩주스", "포도", "햄버거", "호박", 
    "냄비", "대접", "도마", "뒤집개", "뚝배기", "물통", "병솔", "수세미", "숟가락", "스테인레스볼", 
    "식칼", "알루미늄 호일", "어린이용 젓가락", "얼음 트레이", "와플기", "쟁반", "접시", "젓가락", 
    "주걱", "주발", "주방세제", "주방장갑", "주전자", "집게", "채칼", "키친타월", "텀블러", 
    "포크", "포크 스푼", "후라이팬", "감자칼", "거품기", "국자", "나이프", "갑티슈", "기저귀", 
    "두루마리 휴지", "베개", "머리띠", "머리핀", "메이크업 브러쉬", "모기향", "보조배터리", "면봉", 
    "반창고", "슬리퍼", "USB", "화분", "고데기", "눈썹칼", "도끼빗", "롤빗", "브러쉬빗", "염색빗", 
    "비누", "비누받침", "샤워타월", "샴푸", "치간칫솔", "치실", "치약", "칫솔", "면도기", 
    "입욕제", "뚜러뻥", "스퀴지", "건전지", "단추형전지", "돋보기", "드라이어", "딱풀", "로션", 
    "물티슈", "스프레이 살충제", "아령", "연필깎이", "열쇠", "옷걸이", "우산", "유리 세정제", 
    "주판기", "청소솔", "컴퍼스", "테이프클리너", "형광펜", "스케치북", "색연필", "샤프", "핸드백", 
    "필통", "본드", "쓰레받기", "빗자루", "습기제거제", "루빅 큐브", "모자", "반지", "백팩", 
    "볼링핀", "붕대", "손전등", "신발주걱", "아동용 신발", "야구헬멧", "여권", "여성 구두", 
    "운동화", "장화", "재떨이", "주사위", "지갑", "체온계", "축구화", "크록스", "키링", "타이머", 
    "파스", "피규어", "하이힐", "항아리", "물감", "바리깡(헤어컷터)", "빨래집게", "크레파스", 
    "구두약", "글러브", "남성 구두", "넥타이", "단화", "레고", "온도계", "청소기"
]

print(len(given_objects))
print(len(used_objects))

# check if objects in used object is not in given objects
# for obj in used_objects:
#     if obj not in given_objects:
#         print(obj)


# find duplicates obj in given objects
seen = set()
for obj in given_objects:
    if obj in seen:
        print(obj)
    else:
        seen.add(obj)

# for obj in given_objects:
#     if obj not in used_objects:
#         print(obj)